In [1]:
import pandas as pd

In [2]:
tips = pd.read_csv('examples/tips.csv')
tips

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [4]:
tips.columns.values

array(['total_bill', 'tip', 'smoker', 'day', 'time', 'size'], dtype=object)

In [7]:
tips.iloc[1:2, 1:5]

    tip smoker  day    time
1  1.66     No  Sun  Dinner

In [15]:

tips = tips.reset_index()

In [18]:
tips = tips.set_index("smoker")

In [23]:
tips = tips.reset_index()
tips

     index smoker  total_bill   tip   day    time  size
0        0     No       16.99  1.01   Sun  Dinner     2
1        1     No       10.34  1.66   Sun  Dinner     3
2        2     No       21.01  3.50   Sun  Dinner     3
3        3     No       23.68  3.31   Sun  Dinner     2
4        4     No       24.59  3.61   Sun  Dinner     4
..     ...    ...         ...   ...   ...     ...   ...
239    239     No       29.03  5.92   Sat  Dinner     3
240    240    Yes       27.18  2.00   Sat  Dinner     2
241    241    Yes       22.67  2.00   Sat  Dinner     2
242    242     No       17.82  1.75   Sat  Dinner     2
243    243     No       18.78  3.00  Thur  Dinner     2

[244 rows x 7 columns]

In [26]:
tips.sort_values("total_bill")

     index smoker  total_bill    tip   day    time  size
67      67    Yes        3.07   1.00   Sat  Dinner     1
92      92    Yes        5.75   1.00   Fri  Dinner     2
111    111     No        7.25   1.00   Sat  Dinner     1
172    172    Yes        7.25   5.15   Sun  Dinner     2
149    149     No        7.51   2.00  Thur   Lunch     2
..     ...    ...         ...    ...   ...     ...   ...
182    182    Yes       45.35   3.50   Sun  Dinner     3
156    156     No       48.17   5.00   Sun  Dinner     6
59      59     No       48.27   6.73   Sat  Dinner     4
212    212     No       48.33   9.00   Sat  Dinner     4
170    170    Yes       50.81  10.00   Sat  Dinner     3

[244 rows x 7 columns]

In [30]:
tips["total_bill"].argmax()

170

In [39]:
list(tips.dtypes[tips.dtypes == "float64"].index.values)

['total_bill', 'tip']

In [41]:
tips.select_dtypes(include=["bool", "object"]).columns

Index(['smoker', 'day', 'time'], dtype='object')

In [43]:
df = pd.DataFrame({'row': ['00000 UNITED STATES', '01000 ALABAMA', 
                           '01001 Autauga County, AL', '01003 Baldwin County, AL', 
                           '01005 Barbour County, AL']})
df

                        row
0       00000 UNITED STATES
1             01000 ALABAMA
2  01001 Autauga County, AL
3  01003 Baldwin County, AL
4  01005 Barbour County, AL

In [57]:
df["row1"] = df["row"].map(lambda x: x[:5])
df["row2"] = df["row"].map(lambda x: x[5:])

In [58]:
df

                        row   row1                 row2
0       00000 UNITED STATES  00000        UNITED STATES
1             01000 ALABAMA  01000              ALABAMA
2  01001 Autauga County, AL  01001   Autauga County, AL
3  01003 Baldwin County, AL  01003   Baldwin County, AL
4  01005 Barbour County, AL  01005   Barbour County, AL

In [62]:
df[["code", "location"]] = df["row"].str.split(n=1, expand=True)

In [60]:
s = "0 1 2"
s.split(n=1)

TypeError: 'n' is an invalid keyword argument for split()

In [63]:
df

,row,row1,row2,code,location
0,00000 UNITED STATES,00000,UNITED STATES,00000,UNITED STATES
1,01000 ALABAMA,01000,ALABAMA,01000,ALABAMA
2,"01001 Autauga County, AL",01001,"Autauga County, AL",01001,"Autauga County, AL"
3,"01003 Baldwin County, AL",01003,"Baldwin County, AL",01003,"Baldwin County, AL"
4,"01005 Barbour County, AL",01005,"Barbour County, AL",01005,"Barbour County, AL"

In [64]:
df.empty

False

In [69]:
df.apply(lambda row: row.values, axis=1)

0    [00000 UNITED STATES, 00000,  UNITED STATES, 0...
1     [01000 ALABAMA, 01000,  ALABAMA, 01000, ALABAMA]
2    [01001 Autauga County, AL, 01001,  Autauga Cou...
3    [01003 Baldwin County, AL, 01003,  Baldwin Cou...
4    [01005 Barbour County, AL, 01005,  Barbour Cou...
dtype: object

In [70]:
data = pd.DataFrame.from_records(
    [[0, 'A'], [0, 'B'], [1, 'B'], [1, 'C'], [1, 'D'], [2, 'B'], [2, 'D']],
    columns=['number_label', 'category'])

In [71]:
data

   number_label category
0             0        A
1             0        B
2             1        B
3             1        C
4             1        D
5             2        B
6             2        D

In [80]:
data.pivot_table(index=["number_label"], columns=["category"], aggfunc=[len], fill_value=0)

             len
category       A  B  C  D
number_label
0              1  1  0  0
1              0  1  1  1
2              0  1  0  1

In [81]:
data2 = pd.DataFrame.from_dict(
    {'categories': {0: ['A', 'B'], 1: ['B', 'C', 'D'], 2:['B', 'D']}})

In [82]:
data2

  categories
0     [A, B]
1  [B, C, D]
2     [B, D]

In [86]:
data2.index.name = "number_label"
data2

             categories
number_label
0                [A, B]
1             [B, C, D]
2                [B, D]

In [94]:
import collections
data = data2["categories"].apply(collections.Counter)

In [95]:
data

number_label
0            {'A': 1, 'B': 1}
1    {'B': 1, 'C': 1, 'D': 1}
2            {'B': 1, 'D': 1}
Name: categories, dtype: object

In [98]:
pd.DataFrame.from_records(data).fillna(0).apply(lambda col: col.astype(int))

   A  B  C  D
0  1  1  0  0
1  0  1  1  1
2  0  1  0  1

In [89]:
data.map()

pandas.core.series.Series

In [100]:
df = pd.DataFrame( {'a':['A','A','B','B','B','C'], 'b':[1,2,5,5,4,6]})
df

   a  b
0  A  1
1  A  2
2  B  5
3  B  5
4  B  4
5  C  6

In [104]:
result = df.groupby('a').apply(lambda df: list(df['b'])).reset_index(name="new")
type(result)
result

   a        new
0  A     [1, 2]
1  B  [5, 5, 4]
2  C        [6]

In [107]:
import numpy as np
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [109]:
df.groupby("A")[["B", "C", "D"]]

In [110]:
df[df["A"] == "foo"]

     A      B  C   D
0  foo    one  0   0
2  foo    two  2   4
4  foo    two  4   8
6  foo    one  6  12
7  foo  three  7  14

In [111]:

df[df["A"] != "foo"]

     A      B  C   D
1  bar    one  1   2
3  bar  three  3   6
5  bar    two  5  10

In [113]:
print(df.to_string())

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [122]:
df["C"] = df["C"].astype("float64")

In [123]:
df.dtypes

A     object
B     object
C    float64
D      int64
dtype: object

In [125]:
df.convert_dtypes().dtypes

A    string
B    string
C     Int64
D     Int64
dtype: object

In [138]:
df = pd.DataFrame({"Col X": ['class 1', "class 1", 'class 2', 'class 3', 'class 2'],
                   "Col Y": ['cat 1', "cat 1", 'cat 1', 'cat 2', 'cat 3']})
df

     Col X  Col Y
0  class 1  cat 1
1  class 1  cat 1
2  class 2  cat 1
3  class 3  cat 2
4  class 2  cat 3

In [139]:
df.pivot_table(index=["Col X"], columns=["Col Y"], aggfunc=[len], fill_value=0)

          len
Col Y   cat 1 cat 2 cat 3
Col X
class 1     2     0     0
class 2     1     0     1
class 3     0     1     0

In [152]:
df.groupby(["Col X", "Col Y"]).size().unstack('Col Y', fill_value=0)

Col Y    cat 1  cat 2  cat 3
Col X
class 1      2      0      0
class 2      1      0      1
class 3      0      1      0

In [153]:
df1 = pd.DataFrame(data = {'col1' : [1, 2, 3, 4, 5, 3], 
                           'col2' : [10, 11, 12, 13, 14, 10]}) 
df2 = pd.DataFrame(data = {'col1' : [1, 2, 3],
                           'col2' : [10, 11, 12]})

In [154]:
df1

   col1  col2
0     1    10
1     2    11
2     3    12
3     4    13
4     5    14
5     3    10

In [155]:
df2

   col1  col2
0     1    10
1     2    11
2     3    12

In [162]:
df3 = df1.merge(df2, how="left", indicator="Ind")
df3

   col1  col2        Ind
0     1    10       both
1     2    11       both
2     3    12       both
3     4    13  left_only
4     5    14  left_only
5     3    10  left_only

In [165]:
df3[df3["Ind"] == "left_only"].drop("Ind", axis=1)

   col1  col2
3     4    13
4     5    14
5     3    10